{
	"extensionName": {
		"message": "Modo oscuro para Outlook™"
	},
	"extensionShortName": {
		"message": "MOPO"
	},
	"extensionDescription": {
		"message": "Un mejor tema oscuro (extraoficial) para Microsoft Outlook™"
	},
	"storeDescriptionHeader": {
		"message": "🔶 Descripción 🔶"
	},
	"storeDescriptionText": {
		"message": "Una extensión del navegador que aplica un modo oscuro mejor (no es oficial) a Microsoft Outlook y elimina la barra lateral de anuncios. Disponible para Chrome, Firefox, Edge y Opera, y compatible con Firefox móvil.\n\nLos estilos se aplican automáticamente a las URL conocidas de Outlook. Si su servidor de intercambio de Outlook se ejecuta en un dominio personalizado, agregue este dominio en las opciones de extensión."
	},
	"storePrivacyHeader": {
		"message": "🔶 Privicidad 🔶"
	},
	"storePrivacyText": {
		"message": "Esta extensión ninguna recopila ni transmite ninguna información personal. Consulte a continuación para obtener una explicación de requeridos permisos los por esta extensión."
	},
	"storeRequiredPermissionsHeader": {
		"message": "🔸 Permisos Requeridos 🔸"
	},
	"storeRequiredPermissionsText": {
		"message": "Se requiere acceso a cualquier sitio en siguientes dominios los para que podamos aplicar estilos personalizados:\n▸ http(s)://outlook.live.com/\n▸ http(s)://outlook.office.com/\n▸ http(s)://outlook.office365.com/\n▸ http(s)://support.office.live.com/\nSe requiere acceso al almacenamiento para que podamos guardar la configuración de la extensión."
	},
	"storeOptionalPermissionsHeader": {
		"message": "🔸 Permisos Opcionales 🔸"
	},
	"storeOptionalPermissionsText": {
		"message": "Estos permisos se solicitan solo cuando son necesarios:\n▸ tabs: Se requiere acceso a pestañas abiertas si está utilizando la función Dominios Personalizados. Esto es para que podamos verificar si alguna pestaña abierta coincide con los dominios personalizados que especificó.\n▸ http(s)://*/: Se requiere acceso a 'cualquier sitio' si está utilizando la función Personalizados Dominios. Esto es para que podamos aplicar estilos a cualquier dominio que especifique. Tenga en cuenta que la extensión no tiene acceso a todos los sitios. Solo solicitará permisos para los dominios personalizados específicos que agregue."
	},
	"storeReportingIssuesHeader": {
		"message": "🔶 Reportar Problemas 🔶"
	},
	"storeReportingIssuesText": {
		"message": "¡Se necesitan traducciones! Si conoce otro idioma y desea ayudar, cree un problema con detalles aquí: https://github.com/jerboa88/dark-mode-for-outlook/issues.\n\nSi encuentra algún problema al usar la extensión, cree un problema o cree una solicitud de extracción usted mismo para solucionar el problema.\n\nIntento corregir la extensión lo antes posible cuando Outlook crea cambios importantes, pero tenga en cuenta que puede llevar algún tiempo adaptar el trabajo a mi horario y realizar todos los cambios que se deben realizar. Gracias por tu paciencia 🙂."
	},
	"storeLicenseHeader": {
		"message": "🔶 Licencia 🔶"
	},
	"storeLicenseText": {
		"message": "Este proyecto tiene la licencia MIT. Consulte el archivo de licencia para obtener más detalles. Outlook es una marca comercial de Microsoft y este proyecto no está afiliado ni respaldado por Microsoft de ninguna manera."
	},
	"optionsHeaderText": {
		"message": "Opciones"
	},
	"optionsAddButtonText": {
		"message": "+ Añadir"
	},
	"optionsRemoveButtonText": {
		"message": "- Eliminar"
	},
	"optionsComposePaneStylingTitle": {
		"message": "[Experimental] Estilo de panel de redacción"
	},
	"optionsComposePaneStylingDescription": {
		"message": "Ya sea para habilitar forzosamente el estilo del modo oscuro para el panel de redacción. Solo habilite esto si desea que el panel de redacción esté oscuro cuando su versión de Outlook no tenga un modo oscuro incorporado. A Outlook no le gusta que juguemos con estos estilos, por lo que probablemente tenga errores. Considere dejar esto sin marcar y escribir correos electrónicos con el fondo predeterminado blanco en su lugar."
	},
	"optionsComposePaneStylingLabel": {
		"message": "¿Forzar el estilo del panel de redacción? (predeterminado: falso)"
	},
	"optionsCustomDomainLabel": {
		"message": "[Experimental] Personalizados Dominios"
	},
	"optionsCustomDomainDescription": {
		"message": "Si su servidor de intercambio de Outlook se ejecuta en un dominio personalizado (ej. https://mail.yourcompany.es/owa), puede agregarlo aquí para que el modo oscuro se aplique a cualquier página de este dominio. Eso estar siendo una función experimental, por lo que es posible que los estilos no se apliquen correctamente. Si encuentra algún problema, cree un informe de error."
	},
	"optionsStatusMessage_success": {
		"message": "Tu configuración se guardó correctamente"
	},
	"optionsStatusMessage_permissionGrantedSuccess": {
		"message": "Dicha autorización"
	},
	"optionsStatusMessage_permissionRequiredError": {
		"message": "Oops! Se requiere permiso para utilizar esta función. Inténtalo de nuevo"
	},
	"optionsStatusMessage_addCustomDomain_success": {
		"message": "El dominio personalizado se agregó correctamente"
	},
	"optionsStatusMessage_addCustomDomain_emptyError": {
		"message": "Oops! No se ingresó ningún dominio personalizado"
	},
	"optionsStatusMessage_addCustomDomain_invalidError": {
		"message": "Oops! Este dominio personalizado no es válido. Comprueba el formato y vuelve a intentarlo."
	},
	"optionsStatusMessage_addCustomDomain_alreadyExistsError": {
		"message": "Oops! Este dominio personalizado ya existe"
	},
	"optionsStatusMessage_addCustomDomain_isReservedError": {
		"message": "Oops! Los estilos se aplican a este dominio de forma predeterminada, por lo que no es necesario ingresarlo como un dominio personalizado. Informe un error si los estilos no se aplican correctamente"
	},
	"optionsStatusMessage_removeCustomDomain_success": {
		"message": "El dominio personalizado se eliminó correctamente"
	},
	"optionsStatusMessage_removeCustomDomain_error": {
		"message": "Oops! Se produjo un error al eliminar el dominio personalizado. Informe esto como un error"
	}
}
